In [1]:
import pandas as ka

print(ka.__version__)

1.2.4

# Membuat Data Frame

In [5]:
df = {'kolom_satu':[1, 2, 3, 4, 5], 
     'kolom dua':[10, 20, 30, 40, 50]}
df = ka.DataFrame(d)
df

   kolom_satu  kolom dua
0           1         10
1           2         20
2           3         30
3           4         40
4           5         50

# Seleksi Baris Dengan query()

Menampilkan data-data yang nilai dari kolom 1 lebih besar dari kolom 2

In [6]:
df.query('kolom_satu > 2')

   kolom_satu  kolom dua
2           3         30
3           4         40
4           5         50

================================================================================================

In [7]:
df.query('`kolom dua` > 30')

   kolom_satu  kolom dua
3           4         40
4           5         50